Repository: common-repository/automatic-file-renamer
Catalog: languages/automatic-file-renamer-*.po
Languages: es_co, fr_be

source: When a media is uploaded, <b>an attachment page is automatically created</b>.<br><p> If your file's name is '<b>horse.jpg</b>', the attachment page will be called '<b>https://your-site.com/horse</b>'.<br>
es_co: Al subir un archivo de medios, <b>se crea automáticamente una página enlazada</b>.<br> <p>Si tu archivo se llama «<b>caballo.jpg</b>», la página se llamará «<b>https://tusitio.com/caballo</b>». <br>
fr_be: Lors du téléversement d'un média, <b>une page liée est automatiquement créée</b>.<br><p>Si votre fichier a pour nom <b>cheval.jpg</b>, la page s'appelera <b>https://votresite.fr/cheval</b>.<br>

source: That can be really annoying, for many reasons
es_co: Esto puede ser muy molesto por muchas razones,
fr_be: Cela peut être très embêtant, pour pleins de raisons

source: mentioned here
es_co: mencionadas aquí
fr_be: évoquées ici

source: Especially since once the page is created, it's very dangerous to rename it !
es_co: Sobre todo porque, una vez creada la página, ¡es muy peligroso renombrarla!
fr_be: D'autant plus qu'une fois que la page est créée, il est très dangereux de la renommer !

source: To avoid this, it's possible thanks to this plugin to rename automatically your files and their attachment pages while the upload.
es_co: Para evitarlo, con este plugin es posible renombrar automáticamente tus archivos y sus páginas enlazadas cuando se suben.
fr_be: Pour éviter cela, il est possible grâce à ce plugin de renommer automatiquement vos fichiers et leur pages liées lors de leur téléversement.

source: Choose evocative terms
es_co: Elige términos con sentido
fr_be: Choisissez des termes évocateurs

source: Browsers (and you too) love when words describe file content !
es_co: ¡A los motores de búsqueda (y a ti también) les encanta que las palabras describan el contenido!
fr_be: Les moteurs de recherche (et vous aussi) aiment quand les mots décrivent le contenu !

source: file-name
es_co: nombre-del-archivo
fr_be: nom-du-fichier

source: .extension
es_co: .extensión

source: Saved !
es_co: ¡Guardado!
fr_be: Enregistré !

source: Currently, your files will be renamed like this :
es_co: En este momento, tus archivos serán renombrados así:
fr_be: Actuellement, vos fichiers seront renommés ainsi :

source: Once saved, the file name cannot be changed. Choose the name BEFORE uploading the file.
es_co: Una vez guardado, el nombre del archivo ya no se puede modificar. Elige el nombre ANTES de subir el archivo.
fr_be: Une fois enregistré, le nom du fichier n'est plus modifiable. Choisissez le nom AVANT de téléverser le fichier.

source: This number changes. it allows to differentiate between two records with the same file name.
es_co: Este número varía. Permite diferenciar entre dos registros con el mismo nombre de archivo.
fr_be: Ce nombre varie. il permet de différencier deux enregistrements avec le même nom de fichier.

source: extension
es_co: extensión

source: This setting will apply to all files that will be uploaded.<br>It's not retroactive.
es_co: Este ajuste se aplicará a todos los archivos que se suban.<br>No es retroactivo.
fr_be: Ce réglage s'appliquera à tous les fichiers qui seront téléversés.<br>Ce n'est pas rétroactif.

source: The redirect hides the linked page.
es_co: La redirección permite ocultar la página enlazada.
fr_be: La redirection permet de cacher la page liée.

source: Redirect to the file url (default).
es_co: Redirige al archivo de medios (por defecto).
fr_be: Renvoie sur le fichier média (défaut).

source: Redirect to the attachment page, if it exists (or else, 404 error).
es_co: Redirige a la página del archivo, si existe (de lo contrario, al error 404).
fr_be: Renvoie sur la page attachée, si elle existe (sinon erreur 404).

source: Redirect to your 404 page.
es_co: Redirige a la página de error 404.
fr_be: Renvoie une erreur 404.

source: Settings only for Administrators
es_co: Configuración reservada para administradores
fr_be: Réglages réservés aux administrateurs

source: Choose wich role(s) can change the above settings :
es_co: Elija qué función(es) puede(n) cambiar la configuración anterior :
fr_be: Choisissez quel(s) role(s) peuvent modifier les réglages ci-dessus :

source: Documentation
es_co: Documentación

source: Renaming enabled
es_co: Renombrado activado
fr_be: Renommage activé

source: Enable renaming
es_co: Activar el renombrado
fr_be: Activer le renommage

source: Redirects enabled
es_co: Redirección activada
fr_be: Redirection activée

source: Enable redirects
es_co: Activar la redirección
fr_be: Activer les redirections
